{"id":"1452756690292","attributes":{"blocks":[{"body":"test","comment":""},{"body":"12345678912345789","comment":""},{"body":"tsSSasswwwwws0asdasdazss123ssdasdsa12","comment":"test"},{"id":1,"body":"CheflSteps Creative Director Tyler Kalberg made us all his signature fried chicken sandwich one fine Friday, and we haven’t been the same since. Inspired by the classic at Chick-Fil-A, Tyler developed this upgraded versionr with his friend Adam Pranica and perfected it in the ChefSteps kitchen with a little help from Nick. Think amazing sous vide fried chicken cooked in pickle juice, fried to perfection, then served on a Hawaiian Sweet Roll with sriracha aioli and a crunchy dill slice. Spicy, sweet, and sour, this ’wich put us in such a celebratory mood, we followed it up with a round of picklebacks—a shot of whiskey followed by a pickle juice chaser—another of Tyler’s dangerously addictive habits. Did a lot of really good work get done that day? Perhaps not, but we’ve been gunning to get you a recipe for this thing ever since.","comment":"This is comment of note 1 - block 1!"},{"body":"test","comment":""},{"body":"test","comment":""},{"id":2,"body":"This is one of those ChefSteps recipes that can be either pretty dang simple or altogether involved. For instance, you can make your own Hawaiian Sweet Rolls, or you can just roll out to the store and pick up a pack of King’s. Same goes for the Kewpie mayo. Heck, you could even DIY the dill pickles if you’re into that sort of thing. Up to you! One thing we very much encourage: make your own fried chicken! Our foolproof method is so easy—and oh so tasty, too. Then all that’s left to do is gather the crew and tell them to come hungry—it’s time for them to try a sweet, sour, spicy, crunchy sandwich that’s easy to consume in vast quantities but very difficult to forget. (Unless picklebacks are in the picture. Picklebacks have a way of making everything pretty easy to forget.)","comment":"This is comment of note 1 - block 2, and it's very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very very long"},{"id":3,"body":"8 each Hawaiian Sweet Rolls\n                  4 each Boneless chicken thighs 1 each Jar of dill pickle slices, including juice\n                  1 recipe Japanese (Kewpie-Style) Mayo, or use store bought\n                  - Sriracha, as needed\n                  - Frying oil, we like canola, as needed 325 g Pastry flour, or all-purpose flour\n                  25 g Paprika\n                  20 g Onion powder\n                  5 g Garlic powder\n                  250 g Buttermilk","comment":"This is comment of note 1 - block 3"}]},"type":"notes"}